[{"front":"Linear independence","back":"A set of vectors is linearly independent if the vector equation x1v1 + x2v2 + … + xnvn = 0 has only the trivial solution x1 = x2 = … = xn = 0"},{"front":"linear system","back":"has coefficient matrix A, right side vector b. if b = 0, the system is homoegenous"},{"front":"wronskian","back":"determinant used to determine independence of functions"},{"front":"autonomous differential equation","back":"a system of ordinary differential equations which does not explicitly depend on the independent variable"},{"front":"general linear system form","back":"am1(x1) + am2(x2) + ... + amn(xn) = bm"},{"front":"rank","back":"number of leading ones in the RRE form of a matrix"},{"front":"Consistent Linear System ","back":"A linear system that has at least one solution is called consistent. Otherwise, it is inconsistent."},{"front":"Super position Principle- Homogeneous ","back":"the sum of two or more solutions of a homogeneous linear differential equation is also a solution"},{"front":"Scalar multiplication","back":"A x B where A is a scalar and B is a vector, resulting in a vector "},{"front":"Variation of Parameters Second Order ODE","back":"x(p)t=u1(t)x1(t) + u2(t)x2(t)"},{"front":"Column space ","back":"The column space of C (C is a matrix a x b) is the sub space of R^a spanned by the columns C"},{"front":"m x n","back":"size of a matrix: m represents the number of rows, n represents the number of columns and the number of variables"},{"front":"x' + P(t)x = f(t)","back":"standard form of a 1st order linear ODE"},{"front":"Asymptotically Stable ","back":"The steady state x̂ is asymptotically stable if there is a positive number 𝛿 such that the limit as t approaches infinity of x(t, X) = x̂ whenever |X - x̂| < 𝛿 ."},{"front":"Free variable ","back":"A variable that does not correspond to a pivot column"},{"front":"backward subsitution","back":"solving a triangular form (found from gaussian elimination) from the bottom row upwards"},{"front":"x(t)=xh(𝑡)+xp(t) ","back":"General Soultion ODE"},{"front":"inconsistent linear system","back":"no solutions, lines never meet in a geometric view of equations"},{"front":"Linear dependence ","back":"A set of vectors is linearly dependent if the vector equation x1v1 + x2v2 + … + xnvn = 0 has more than one trivial solution"},{"front":"RRE Form","back":"A matrix is in RRE form (reduced row-echelon form) if it meets all of these requirements: (1) Any rows of all zeros appear below all nonzero rows; (2) The leading nonzero of any row is a one; (3) Every leading 1 that is lower than another leading 1 is also to the right of it; (3) Every leading 1 is the only nonzero in its column."},{"front":"underdamped","back":"oscillator with complex roots, 0 < ζ < 1"},{"front":"Complex Solutions","back":"If the soultion is to the function factored has lamda equal to a negative root, the soultion is a complex number; imaginary i"},{"front":"Differential equations ","back":"An equation involving an unknown function y=f(x) and one or more of its derivative. Ex: dx/dt=f(t,x) in this case x is the dependent variable while t is the independent variable"},{"front":"critically damped","back":"oscillator with double root, ζ = 1"},{"front":"Span","back":"Span(v1,…,vk) = all possible linear combinations "},{"front":"Gauss-Jordan elimination","back":"reduction of a matrix to its equivalent RRE form"},{"front":"seperable equations","back":"x'=f(x)g(t)"},{"front":"A=Ao^kt  /  A=Ao^-kt","back":"Growth and Decay Formulas "},{"front":"equilibrium solution","back":"a solution to a differential equation whose derivative is zero everywhere"},{"front":"Pivot Columns","back":"The columns of a matrix in RRE form that have leading ones. "},{"front":"Slope Field","back":"a graphical representation of the solutions to a first-order differential equation of a scalar function"},{"front":"Stability","back":"The steady state x̂ is said to be stable if, for any 𝜖 > 0, you can ensure that |x(t, X) - x̂| < 𝜖 for all time whenever |X - x̂| < 𝛿, where 𝛿 depends on 𝜖. If there is no such way to choose 𝛿, then x̂ is unstable. "},{"front":"General solution for nonlinear graph ","back":"x(t)=1/C-t"},{"front":"Homogenous ODE ","back":"𝑑𝑥𝑑𝑡+𝑃(𝑡)𝑥=0"},{"front":"abel's theorem","back":"for linear ODEs, if the wronskian = 0 it is dependent, if it doesn't equal 0 it is independent"},{"front":"row reduction/Gaussian elimination","back":"use of row operations to reduce a matrix to triangular form"},{"front":"Simple Stability Test","back":"If f '(x̂) < 0, then x̂ is asymptotically stable. If f '(x̂) > 0, then x̂ is unstable. f '(x̂) = 0 is ambiguous, so another analysis is needed in order to determine its stability. "},{"front":"Algebraic multiplicity","back":"Multiplicity of an eigenvalue as a root of the characteristic polynomial"},{"front":"equivalent linear systems","back":"Equivalent if and only if they have the same set of solutions "},{"front":"overdamped","back":"oscillator with distinct negative roots, 1 < ζ"},{"front":"Geometric multiplicity ","back":"Dimension of the eigenspace associated with one eigenvalue"},{"front":"row echelon form","back":"all rows with only zeros are put at the bottom of the matrix; the first nonzero term in each row is in a diagonal from the first nonzero term from the row above"},{"front":"Reduced Row Echelon Form ","back":"In each row the leading coeficcient is a leading 1; each column containg a 1 has zeros in all of its other entry points"},{"front":"General Homogenous Equation ","back":"𝑥ℎ(𝑡)=𝑒𝑎𝑡[𝑏1cos(𝜔𝑡)+𝑏2sin(𝜔𝑡)],"},{"front":"Linear combination","back":"Vectors v1, v2, …, vk (same dimension); coefficients c1, c2, …, vk; c1v1 + c2v2 + … + ckvk is a linear combination "},{"front":"Row Operations ","back":"(1) Swap the positions of two equations; (2) Multiply an equation by a nonzero constant; (3) Add a multiple of one equation to another equation."},{"front":"augmented matrix","back":"horizontal concatenation of a coefficient matrix with the right-side vector"},{"front":"Particular Solution","back":"the most general form of the solution of a differential equation, containing arbitrary constants"},{"front":"Free Columns","back":"The columns of a matrix in RRE form that do not have leading ones."},{"front":"Null space","back":"The null space of C (C is a matrix a x b) is the sub space of R^b consisting of all solutions of the homogeneous equation C(x)=0"},{"front":"hooke's law","back":"F=-kx, k = spring constant"},{"front":"euler's formula","back":"e^(it) =  cos(t) + isin(t)"}]